In [3]:
 # Dependencies and Setup
import pandas as pd
import numpy as np

In [4]:
# File to Load 
file_path = "Resources/Lessons_04-Pandas_Homework_Instructions_HeroesOfPymoli_Resources_purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
heroes_file = pd.read_csv(file_path)

In [5]:
heroes_file.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [6]:
players_count = heroes_file ["SN"].nunique()
players_count

576

In [7]:
unique_items = heroes_file["Item Name"].nunique()
unique_items

179

In [8]:
average_price = heroes_file["Price"].mean()
average_price

3.050987179487176

In [9]:
purchases = heroes_file["Item ID"].count()
purchases

780

In [10]:
total_revenue = heroes_file["Price"].sum()
total_revenue

2379.77

In [11]:
#Hacemos dos dataframes para presentar los datos obtenidos
summarydf = pd.DataFrame({"Total Players": [576]})
summarydf

   Total Players
0            576

In [12]:
financialdf = pd.DataFrame({"Number of Unique Items": [179], "Average Price": [3.050987179487176], 
                           "Number of Purchases": [780], "Total Revenue": [2379.77]})
financialdf

   Number of Unique Items  Average Price  Number of Purchases  Total Revenue
0                     179       3.050987                  780        2379.77

In [13]:
#Gender demographics
group_gender = heroes_file.groupby("Gender")
group_gender.count()

                       Purchase ID   SN  Age  Item ID  Item Name  Price
Gender
Female                         113  113  113      113        113    113
Male                           652  652  652      652        652    652
Other / Non-Disclosed           15   15   15       15         15     15

In [14]:
total_gender = group_gender["SN"].nunique()

In [15]:
gender_percent = (total_gender/players_count)*100

In [50]:
gender_table = pd.concat([total_gender, gender_percent], axis=1)
gender_table.columns=["Total Count", "Percentage of Players"]
gender_table

                       Total Count  Percentage of Players
Gender
Female                          81              14.062500
Male                           484              84.027778
Other / Non-Disclosed           11               1.909722

In [17]:
gender_average = group_gender["Price"].mean()

In [18]:
gender_total = group_gender["Price"].sum()

In [19]:
gender_perperson = average_price/group_gender["SN"].count()

In [20]:
purchase_count = group_gender["Item ID"].count()

In [21]:
#Average per person

In [52]:
gender_summary = pd.concat([purchase_count, gender_average, gender_total, gender_perperson], axis=1)
gender_summary.columns=["Purchase Count", "Average Purchase Price", 
                        "Total Purchase Value", "Avg Total Purchase per Person"]
gender_summary

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,3.203009,361.94,0.027000
Male,652,3.017853,1967.64,0.004679
Other / Non-Disclosed,15,3.346000,50.19,0.203399

In [23]:
heroes_norepeat = heroes_file.loc[ :, ["SN", "Age"]]
heroes_norepeat.drop_duplicates(subset=['SN'])

                SN  Age
0          Lisim78   20
1      Lisovynya38   40
2       Ithergue48   24
3    Chamassasya86   24
4        Iskosia90   23
..             ...  ...
773         Hala31   21
774     Jiskjask80   11
775     Aethedru70   21
777     Yathecal72   20
778        Sisur91    7

[576 rows x 2 columns]

In [24]:
#Age demographics
age_bins = [0, 9, 14, 19, 24, 29, 34, 39, 100]
labels = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "+40"]
pd.cut(heroes_norepeat["Age"], age_bins, labels=labels)

0      20-24
1        +40
2      20-24
3      20-24
4      20-24
       ...
775    20-24
776    20-24
777    20-24
778      <10
779    20-24
Name: Age, Length: 780, dtype: category
Categories (8, object): ['<10' < '10-14' < '15-19' < '20-24' < '25-29' < '30-34' < '35-39' < '+40']

In [25]:

heroes_norepeat["Age range"]= pd.cut(heroes_norepeat["Age"], age_bins, labels=labels)
age_group = heroes_norepeat.groupby("Age range")
age_count = age_group["Age range"].count()

In [26]:
age_percent = (age_count/players_count)*100

In [53]:
age_summary = pd.concat([age_count, age_percent], axis=1)
age_summary.columns=["Total Count", "Percentage of Players"]
age_summary

       Total Count  Percentage of Players
<10             23               3.993056
10-14           28               4.861111
15-19          136              23.611111
20-24          365              63.368056
25-29          101              17.534722
30-34           73              12.673611
35-39           41               7.118056
+40             13               2.256944

In [28]:
#Purchasing analysis (Age)
age_bins = [0, 9, 14, 19, 24, 29, 34, 39, 100]
labels = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "+40"]
pd.cut(heroes_file["Age"], age_bins, labels=labels)

0      20-24
1        +40
2      20-24
3      20-24
4      20-24
       ...
775    20-24
776    20-24
777    20-24
778      <10
779    20-24
Name: Age, Length: 780, dtype: category
Categories (8, object): ['<10' < '10-14' < '15-19' < '20-24' < '25-29' < '30-34' < '35-39' < '+40']

In [29]:
heroes_file["Age group"]= pd.cut(heroes_file["Age"], age_bins, labels=labels)
age_purchasing_group = heroes_file.groupby("Age group")

In [30]:
age_count = age_purchasing_group["Price"].count()

In [31]:
age_av = age_purchasing_group["Price"].mean()

In [32]:
age_sum = age_purchasing_group["Price"].sum()

In [33]:
age_purchase_pp = age_sum/players_count

In [54]:
age_table = pd.concat([age_count, age_av, age_sum, age_purchase_pp], axis=1)
age_table.columns=["Purchase Count","Average Purchase Price", "Total Purchase Value", "Avg Total Purchase per Person"]
age_table

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age group,,,,
<10,23,3.353478,77.13,0.133906
10-14,28,2.956429,82.78,0.143715
15-19,136,3.035956,412.89,0.716823
20-24,365,3.052219,1114.06,1.934132
25-29,101,2.900990,293.00,0.508681
30-34,73,2.931507,214.00,0.371528
35-39,41,3.601707,147.67,0.256372
+40,13,2.941538,38.24,0.066389

In [35]:
#Top spenders
buyers_grouped = heroes_file.groupby("SN")
buyers_count = buyers_grouped["Price"].count()

In [36]:
buyers_mean = buyers_grouped["Price"].mean()

In [37]:
buyers_sum = buyers_grouped["Price"].sum()

In [57]:
buyers_table = pd.concat([buyers_count, buyers_mean, buyers_sum], axis=1)
buyers_table.columns=["Purchase Count", "Average Purchase Price", "Total Purchase Value"]

In [63]:
sorted_buyers = buyers_table.sort_values("Average Purchase Price", ascending=False)
sorted_buyers.head()

                Purchase Count  Average Purchase Price  Total Purchase Value
SN
Dyally87                     1                    4.99                  4.99
Lirtilsa71                   1                    4.94                  4.94
Yarithsurgue62               1                    4.94                  4.94
Ririp86                      1                    4.94                  4.94
Chanirrasta87                1                    4.94                  4.94

In [64]:
#Most Popular items
popular_items = heroes_file.loc[ :, ["Item ID", "Item Name", "Price"]]

In [40]:
grouped_popular = popular_items.groupby(["Item ID", "Item Name"])

In [65]:
popular_count = grouped_popular.count()

In [66]:
popular_sum = grouped_popular.sum()

In [67]:
popular_average = grouped_popular.mean()

In [70]:
popular_table = pd.concat([popular_count, popular_average, popular_sum], axis=1)
popular_table.columns=["Purchase Count", "Item Price", "Total Purchase Value"]
popular_table.head()

                            Purchase Count  Item Price  Total Purchase Value
Item ID Item Name
0       Splinter                         4      1.2800                  5.12
1       Crucifer                         4      2.9425                 11.77
2       Verdict                          6      2.4800                 14.88
3       Phantomlight                     6      2.4900                 14.94
4       Bloodlord's Fetish               5      1.7000                  8.50